# EdgeEndPoint Constructor (EdgeEndPoint) (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
EdgeEndPoint Constructor (EdgeEndPoint)
EdgeEndPoint Class See Also
---
Creates a copy of the given EdgeEndPoint instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2021
# Syntax
C#
---
```text
public EdgeEndPoint(
	EdgeEndPoint otherObject
)
```

Visual Basic
---
```text
Public Sub New ( _
	otherObject As EdgeEndPoint _
)
```

Visual C++
---
```text
public:
EdgeEndPoint(
	EdgeEndPoint^ otherObject
)
```

# ### Parameters
otherObject
    Type: Autodesk.Revit.DB..::..EdgeEndPoint The given EdgeEndPoint instance.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
EdgeEndPoint Class
EdgeEndPoint Overload
Autodesk.Revit.DB Namespace